# Load library

In [1]:
# python built-in libraries
import os
from datetime import datetime, timedelta

# python third party libraries
import matplotlib.pyplot as plt
import numpy as np
import pandas as pd

# setting
random_state = 79

# Q1

## make dummy data

In [2]:
students = pd.DataFrame({'name' : ['Andy', 'Jose', 'Dieu', 'Chloe', 'Jose'], 'continent' : ['America', 'Europe', 'Asia', 'America', 'Europe'], 'college' : ['Lib Arts', 'Business', 'Engineering', 'Engineering', 'Business']})
students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering
4   Jose    Europe     Business

In [3]:
#A)

## drop_duplicates : return DataFrame
students = students.drop_duplicates(keep = 'first')
students

    name continent      college
0   Andy   America     Lib Arts
1   Jose    Europe     Business
2   Dieu      Asia  Engineering
3  Chloe   America  Engineering

In [4]:
#B)

COUNT = students.groupby(['continent', 'college'])['name'].count().to_frame().reset_index()
COUNT

  continent      college  name
0   America  Engineering     1
1   America     Lib Arts     1
2      Asia  Engineering     1
3    Europe     Business     1

In [5]:
#C)

COUNT_PIVOT = COUNT.pivot(index = 'college', columns = 'continent', values='name')
COUNT_PIVOT

continent    America  Asia  Europe
college
Business         NaN   NaN     1.0
Engineering      1.0   1.0     NaN
Lib Arts         1.0   NaN     NaN

In [6]:
#D)

COUNT_PIVOT = COUNT_PIVOT.reset_index()
COUNT_PIVOT

continent      college  America  Asia  Europe
0             Business      NaN   NaN     1.0
1          Engineering      1.0   1.0     NaN
2             Lib Arts      1.0   NaN     NaN

In [7]:
#E)

COUNT_PIVOT.fillna(0, inplace = True)
COUNT_PIVOT

continent      college  America  Asia  Europe
0             Business      0.0   0.0     1.0
1          Engineering      1.0   1.0     0.0
2             Lib Arts      1.0   0.0     0.0

In [8]:
#F)

COUNT_PIVOT.sort_values(by = 'college', axis=0, inplace=True)
COUNT_PIVOT

continent      college  America  Asia  Europe
0             Business      0.0   0.0     1.0
1          Engineering      1.0   1.0     0.0
2             Lib Arts      1.0   0.0     0.0

# Q2

## A

### make dummy data

In [13]:
df = pd.DataFrame({'month' : ['jan', 'feb', 'may', 'apr', 'may', 'jun'], 'eggs' : [47, 110, 221, 77, 132, 205], 'salt' : [12.0, 50.0, 89.0, 87.0, 0.0, 60.0], 'spam' : [17,31, 72, 20, 52, 55]})
df

  month  eggs  salt  spam
0   jan    47  12.0    17
1   feb   110  50.0    31
2   may   221  89.0    72
3   apr    77  87.0    20
4   may   132   0.0    52
5   jun   205  60.0    55

In [14]:
df = df.set_index('month')
df

       eggs  salt  spam
month
jan      47  12.0    17
feb     110  50.0    31
may     221  89.0    72
apr      77  87.0    20
may     132   0.0    52
jun     205  60.0    55

### A

In [15]:
## A)
## answer = A

(df.loc[['apr', 'may', 'jun'],]['eggs'] > 100).sum()

3

## B)

In [16]:
## B)
## answer = A

import datetime
datetime.datetime.strptime('01012018', '%d%m%Y').date()

datetime.date(2018, 1, 1)

### C

In [17]:
## C)
## answer = B

## R